# 빅데이터 시대에는 데이터를 많이 확보했거나 확보 할 수 있는 기업이 혁신을 시도하거나 경쟁력과 생
# 산성 향상을 도모하기에 유리하다. 다음 보기 중 이러한 속성에 부합되기 어려운 기업 분류는? # 1
#
# 1. 신용카드회사
# 2. 여행회사
# 3. B2B기업
# 4. 이동통신사
#
# 답 3
#
# 데이터와 정보의 차이를 구분하는 것은 중요하다. 다음 중 정보에 대한 예로 가장 부적절한 것은? # 2
#
# 1. 평균 구매액
# 2. 주문 수량
# 3. 베스트셀러
# 4. 우량 고객
#
# 답 2
#
# 영화 '마이너리티 리포트'에 나오는 것처럼 범죄 예측 프로그램에 의해 범행을 저지르기 전에 체포될
# 수 도 있는 사례를 통해 알 수 있는 빅데이터 시대의 위기 요인으로 적절한 것은? # 3
#
# 1. 소셜 네트워크
# 2. 사생활 침해
# 3. 데이터 오용
# 4. 책임 원칙 훼손
#
# 답 4
#
# 미국을 의미하는 'The Unites States'는 미국의 남북전쟁이 발발하기 전까지는 아메리카 대륙의 주(州)
# 들이 연합이라는 의미로 복수로 취급되었다는 것을 구글의 'Ngram Viewer'를 통해 확인 할 수 있었
# 는데 이와 같이 빅데이터에 거는 기대를 표현한 것은 어느 것인가? # 4
#
# 1. 산업혁명의 석탄, 철
# 2. 21세기의 원유
# 3. 렌즈
# 4. 플랫폼
#
# 답 3
#
# 다음 중 빅데이터의 가치 산정이 어려운 이유의 사례로 보기에 어려운 것은? # 5
#
# 1. 전기차 배터리 정보를 충전소 최적지 선정과 같은 2차적 목적에 활용
# 2. 은행 대출심사 알고리즘 작동 원리 이해의 어려움
# 3. 구글 검색에서 나타나는 것과 같은 데이터의 반복적 재사용
# 4. 독자의 전자책 독서 순서 정보가 저자의 글쓰기 방식에 영향을 주는 형상
#
# 답 2
#
# 전략적 분석을 통해 놀라운 성과를 얻은 미국의 최대 카지노 관련 회사인 하라스엔터테인먼트의 회장
# 인 러브먼은 분석 기반 경영이 도입되지 못하는 이유를 이야기하였다. 보기에서 그 내용이 아닌 것은?
# # 6
#
# 1. 기존 관행을 그냥 따를 뿐 중요한 시도를 하지 않는다.
# 2. 경영진이 의사결정을 할 때 직관적으로 결정했을 때 성과가 나오는 것을 경영진의 진정한 재능이라
# 고 생각한다.
# 3. 분석적 실험을 능숙하게 해내는 사람이 많지 않고 적절한 방법조차 제대로 익히지 못한 사람이 분
# 석업무를 한다.
# 4. 사람들은 아이디어를 낸 사람이 누군지 보다는 아이디어 자체에 관심을 더 많이 가지고 있다.
#
# 답 4
#
# 인문학 열풍 중 최근 사회경제적 환경의 변화로 아닌 것은? # 7
#
# 1. 복잡한 세계화에서 단순한 세계화로 변화했다.
# 2. 비즈니스의 중심이 제품생산에서 서비스로 이동되었다.
# 3. 경제와 산업의 논리가 생산에서 시장창조로 바뀌었다.
# 4. 기존 사고의 틀을 벗어나 문제를 바라보고 창의적으로 문제를 해결하는 능력이 요구되고 있다.
#
# 답 1
#
# 다음 개인정보 비식별화 기술 중 아래에서 설명하고 있는 것으로 가장 적절한 것은? # 8
#
# · 개인정보의 주요 식별요소를 다룬 값으로 대체하여 개인 식별을 어렵게 만드는 기술
#
# 1. 가명처리(pseudonytmization)
# 2. 데이터삭제(data Reduction)
# 3. 범주화(data suppression)
# 4. 데이터마스킹(data masking)
#
# 답 1
#
# KDD 분석 절차 중 분석 목적에 맞는 변수를 찾고 데이터 차원을 축소하는 과정은? # 9
#
# 1. 데이터셋(Selection)
# 2. 데이터 전처리(Processing)
# 3. 데이터 변환(Transformation)
# 4. 데이터 마이닝(Data Mining)
#
# 답 3
#
# 데이터 분석 방법론 중 CRISP-DM에 대한 설명으로 옳지 않은 것은? # 10
#
# 1. 1996년 유럽연합의 ESPRIT에서 있었던 프로젝트에서 시작되어 SPSS, NCR, Daimler Chrysler 등이
# 참여하였다.
# 2. 각 단계를 폭포수 모델처럼 구성되어져 있다.
# 3. 모델링과정에서 데이터셋이 추가로 필요한 경우 데이터 준비 단계를 반복 수행 할 수 있다.
# 4. CRISP-DM은 계층적 프로세스 모델로써 4레벨로 구성되어 있다.
#
# 답 2