# 비즈니스 모델 캔버스를 활용한 과제 발굴 영역에 대한 설명으로 옳지 않은 것은? # 11
#
# 1. 업무 : 제품 및 서비스를 생산하기 위해서 운영하는 내부 프로세스 및 주요 자원 관련 도출
# 2. 제품 : 생산 및 제공하는 제품 서비스를 개선하기 위한 관련 주제 도출
# 3. 고객 : 제품·서비스를 제공받는 사용자 및 고객, 이를 제공하는 채널의 관점에서 관련 주제 도출
# 4. 규제와 감사 : 분석을 수행하는 시스템 영역 및 이름 운영·관리하는 시스템의 관점에서 주제 도출
#
# 답 4
#
# 분석 과제를 도출하기 위한 상향식 접근방식에 대한 설명으로 옳지 않은 것은? # 12
#
# 1. 상향식 접근방식의 데이터 분석은 비지도 학습방법에 의해 수행된다.
# 2. 분석적으로 사물을 인식하려는 'Why'관전에서 접근한다.
# 3. 인과관계로부터 상관관계분석으로의 이동이라는 변화를 만들었다.
# 4. 사물을 있는 그대로 인식하는 'What'관점에서 접근한다.
#
# 답 2
#
# 분석과제의 주요 관리 영역이 아닌 것은? # 13
#
# 1. Data Size
# 2. Data Complexity
# 3. Speed
# 4. Analytic & Accessibility
#
# 답 4
#
# 마스터 플랜 수립 시점에서 데이터 분석의 지속적인 적용과 확산을 위한 거버넌스 체계의 구성 요소가
# 아닌 것은? # 14
#
# 1. Process
# 2. System
# 3. Organization
# 4. Data Resource
#
# 답 4
#
# 기업의 데이터 분석 수준을 진단하는 과정에서 기업에 필요한 6가지 분석 구성요소를 갖추고 있고,
# 현재 부분적으로 도입되어 지속적인 확산이 필요한 기업들의 분석 수준을 포트폴리오 사분면으로
# 정의한다면 어디에 해당하는가? # 15
#
# 1. 준비형 기업
# 2. 도입형 기업
# 3. 정착형 기업
# 4. 확산형 기업
#
# 답 4
#
# 다음 중 분석 프로그램 관리에 대한 설명으로 가장 부적절한 것은? # 16
#
# 1. 분석 프로젝트 관리는 프로젝트 관리 지침(KSA ISO 21500:2013)을 가이드로 활용할 수 있다.
# 2. 데이터 분석 모델의 품질을 평가하기 위해서 SPICE를 활용할 수 있다.
# 3. 분석 프로젝트의 일정계획 수립시 데이터 수집에 대한 철저한 통제와 관리가 필요하다.
# 4. 분석 프로젝트의 최종 결과물이 분석 보고서 형태 또는 시스템인지에 따라 프로젝트 관리에 차이가
# 있다.
#
# 답 3
#
# 다음 중 이산형 확률분포에 해당하지 않는 것은? # 17
#
# 1. 기하 분포
# 2. 잏항 분포
# 3. 지수 분포
# 4. 초기하 분포
#
# 답 3
#
# 다음 중 R에서 사용가능한 데이터 오브젝트에 관한 설명으로 가장 부적절한 것은? # 18
#
# 1. 차원을 가진 벡터를 행렬이라고 한다.
# 2. 리스트에서 원소들은 다른 모드여도 상관없다.
# 3. 벡터에서 모든 원소는 같은 모드여야 한다.
# 4. 데이터프레임은 테이블로 된 데이터 구조로써 행렬로 표현된다.
#
# 답 4
#
# 다음 중 결과가 다른 R코드는? # 19
#
# 1. a<-c(1,10)
# 2. b<-seq(1,10,1)
# 3. c<-1:10
# 4. d<-seq(10,100,10)/10
#
# 답 1
#
# 종속변수를 설명하는데 가장 가장 중요한 독립변수로 적절한 것은? # 20
#
# 1. p-value가 가장 작은 변수
# 2. 표준화 자료로 추정한 계수가 가장 큰 변수
# 3. 원 자료로 추정한 계수가 가장 큰 변수
# 4. 종속변수와의 상관관계분석에서 상관계수가 가장 큰 변수
#
# 답 2
# 