# 아래 거래 전표에서 연관성 규칙 A -> B 때의 지지도는? # 21
#
# 아래
# 물품	거래건수
# {A}	10
# {B}	5
# {C}	25
# {A,B,C}	5
# {B,C}	20
# {A,B}	20
# {A,C}	15
#
# 1. 15%
# 2. 20%
# 3. 25%
# 4. 30%
#
# 답 3
#
# 다음 중 중심극한 정리(Central Limit Theorem)에 대한 설명으로 가장 부적절한 것은? # 22
# 1. 여러 통계적 방법론에는 정규데이터가 필요하지만 중심극한 정리를 사용하면 비정규적인 모집단에
# 도 이와 유사한 절차를 적용할 수 있다.
# 2. 표본평균의 분포는 표본의 크기가 커짐에 따라 정규분포로 근사한다.
# 3. 모집단의 분포가 정규분포에 가까워져야 표본평균의 분포가 정규분포로 근사하게 된다.
# 4. 모집단의 분포가 대칭이면 표본의 크기가 작아도 되지만 모집단의 분포가 비대칭이면 표본의 크기
# 가 30이상이 되어야 한다.
#
# 답 3
#
# 다음은 데이터의 첫도에 관한 설명이다. 설명이 틀린 것은? # 23
#
# 1. 명목척도는 측정 대상이 어느 집단에 속하는지 분류할 때 사용되며 성별, 출생지, 정보가 해당된다.
# 2. 순서척도는 측정 대상이 순서를 갖는 자료를 의미하며, 만족도, 선호도, 학년, 신용등급 정보가 해당
# 된다.
# 3. 구간척도는 측정 대상의 순서와 순서 사이의 간격이 의미가 있는 자료를 의미하며, 온도, 물가지수,
# 주가지수 정보가 해당된다.
# 4. 비율척도는 측정대상의 값이 비율로 정의되는 자료를 의미하며, 물가성장율, 흡연감소율의 정보가
# 해당된다.
#
# 답 4
#
# 다음은 확률변수에 관한 설명이다. 설명이 옳지 않은 것은? # 24
#
# 1. 확률변수는 특정값이 나타날 가능성이 확률적으로 주어지는 변수이며, 실수값으로 표현된다.
# 2. 이산형 확률변수는 확률변수의 공간이 유한하거나 셀 수 있는 경우를 의미하며, 이항분포, 기하분포,
# 다항분포가 해당된다
# 3. 연속형 확률변수는 확률변수의 공간이 무한한 경우를 의미하며, 베르누이 확률분포, 포아송 분포,
# 정규분포가 해당된다.
# 4. 균일분포는 확률변수의 구간[a,b] 냉[서 모든 확률이 동일한 분포를 의미하며 확률은 1/(b-a)가 된다.
#
# 답 3
#
# 회귀분석에서 변수 선택법에 대한 설명으로 가장 부적절한 것은? #25
#
# 1. 전진선택법은 중요하다고 생각되는 설명변수부터 차례로 선택하는 방법이다.
# 2. 전진선택법과 후진선택법의 결과가 항상 동일하지는 않다.
# 3. 모든 가능한 회귀모형은 독립변수들의 조합으로 이루어진 회귀모형 중 가장 적합하게 나타난 모형
# 을 선택하는 방법이다.
# 4. 전진선택법으로 변수를 추가할 때 기존의 변수들의 중요도는 영향을 받지 않는다.
#
# 답 4
#
# 분해시계열에 대한 설명 중 잘못된 것은? # 26
#
# 1. 분해시계열이란 시계열에 영향을 주는 일반적인 요인을 시계열에서 분리해 분석하는 방법을 말한다.
# 2. 분해 시계열의 분해 요소는 추세요인, 게절요인, 순환요인, 회귀요인으로 크게 4가지로 이루어 진다.
# 3. 추세요인은 자료의 형태가 오르거나 내리는 추세를 따르는 경우로 선형적 형태, 지수형태 등이 있다.
# 4. 순환요인은 경제적이나 자연적인 이유가 없이 알려지지 않은 주기를 가지고 변화하는 자료 형태이다.
#
# 답 2
#
# 두 개 이상의 독립변수를 사용해 하나의 종속변수의 변화를 설명하는 다중회귀분석을 실시할 것이다.
# 다음 중 모형을 적합 시킨 후, 모형이 적절한 지 확인하기 위해 체크해야 할 사항으로 부적절한 것은?
# # 27
#
# 1. 상관게수를 통해 모형의 설명력을 확인한다.
# 2. F-value를 통해 모형이 통계적으로 유의한지 확인한다.
# 3. 모형이 데이터에 잘 적합되어 있는지를 확인한다.
# 4. t-value, p-value를 통해 유의한지 확인한다.
#
# 답 1
#
# 주성분분석은 차원의 단순화를 통해 서로 상관되어 있는 변수들 간의 복잡한 구조를 분석하는 것이 목
# 적이다. 다음 중 주성분분석에 대한 설명으로 적절하지 않은 것은 무엇인가? # 28
#
# 1. 다변량 자료를 저차원의 그래프로 표시하여 이상치(Outlier) 탐색에 사용한다.
# 2. 변수들끼리 상관성이 있는 경우, 해석상의 복잡한 구조적 문제가 발생하는데 이를 해결하기 위해
# 사용한다.
# 3. 회귀분석에서 다중공선성(Multicollinearity)의 문제를 해결하기 위해 활용한다.
# 4. p객의 변수들을 중요한 m(p)개의 주성분으로 표현하여 전체 변동을 설명하는 것으로 m개의 주성
# 분은 원래 변수는 관계없이 생성된 변수들이다.
#
# 답 4
#
# 아래는 데이터프레임 mtcars를 이용해 회귀분석을 수행한 R 명령의 결과이다. 다음 중 이 결과에 대한
# 설명으로 가장 부적절한 것은? # 29
#
# 1. 오차의 표준편차 추정치는 2.65이다.
# 2. 모든 독립변수가 유의수준 0.1에서 유의하지 않다.
# 3. 후진제거법을 적용할 때 가장 먼저 제거될 독립변수는 cyl이다.
# 4. 유의수준 0.01하에서 이 회귀모형은 유의하다.
#
# 답 2
#
# 데이터마이닝을 위한 데이터 분할에 대한 설명으로 틀린 것은 어느 것인가? # 30
#
# 1. 데이터를 구축용(training), 검정용(validation), 시험용(test) 으로 분리한다.
# 2. 일반적으로 데이터 구축용, 시험용 데이터는 50%, 30%, 20%로 정한다.
# 3. 데이터가 충분하지 않을 때는 구축용과 시험용 데이터만 구분하여 활용한다.
# 4. 통계학에 적용되는 교차확인(cross-calidation)은 데이터마이닝에서 활용할 수 없다.
#
# 답 4
#
#
