# Default 데이터는 10,000명의 신용카드 고객에 대한 체납 여부(default)와 학생여부(student), 카드 잔고
# (balance), 연봉(income)을 포함하고 있다. 고객의 체납 확률을 예측하기 위한 아래 결과에 대한 설명으
# 로 가장 부적절한 것은? # 31
#
# 1. 로지스틱 회귀모형을 사용한 결과이다.
# 2. 카드 잔고와 연봉이 동일한 수준일 때, 학생(studentYes)이 학생이 아닌 고객보다 체납확률이 낮다.
# 3. 세 설명변수 모두 체납확률을 예측하는데 유익한 영향이 있다.
# 4. 동일한 신분과 연봉 수준일 때 카드 잔고가 높을수록 체납 확률이 높다.
#
# 답 3
#
# 데이터마이닝 분석 기법 중 의사결정나무 분석의 특성으로 잘못 표현한 것은 어느 것인가? # 32
#
# 1. 의사결정나무 모형의 결과는 누구나 이해가 쉽고 설명이 용이하다.
# 2. 의사결정나무 알고리즘의 모형 정확도는 다른 분류모형에 뒤지지 않는다.
# 3. 의사결정나무 알고리즘은 대용량 데이터에서도 빠르게 만들 수 있고 데이터의 분류 작업도 신속히
# 진행할 수 있다.
# 4. 의사결정나무 알고리즘은 비정상적인 잡음 데이터에서는 민감하여 분류가 쉽지 않다.
#
# 답 4
#
# 다음 중 비모수적 방법에 대한 설명으로 가장 부적절한 것은? # 33
#
# 1. 관측된 자료가 주어진 분포를 따른다는 가정을 받아들일 수 없을 때 이용하는 검정법이다.
# 2. 자료가 추출된 모집단의 분포에 대해 제약을 가하지 않고 검정을 실시하는 방법이다.
# 3. 관측된 자료로 구한 표본평균과 표본분산 등을 이용해 검정을 실시한다.
# 4. 관측된 자료가 특정 분포를 따른다고 가정할 수 없을 때 이용한다.
#
# 답 3
#
# 비계층적 군집분석의 장점에 대한 설명이 잘못된 것은? # 34
#
# 1. 주어진 데이터의 내부 구조에 대한 사전 정보가 없어도 의미 있는 결과를 얻을 수 있다.
# 2. 다양한 형태의 데이터의 적용이 가능하다.
# 3. 분석방법의 적용이 용이하다.
# 4. 사전에 주어진 목적이 없으므로 결과 해석이 쉽다.
#
# 답4
#
# 아래 데이터 마이닝 분석 예제 중 비지도(unsupervised) 분석을 수행해야 하는 예제는? # 35
#
# 아래
# 가. 우편물에 인쇄된 우편번호 판별 분석을 통해 우편물을 자동으로 분류
# 나. 고객의 과거 거래 구매 패턴을 분석하여 고객이 구매하지 않은 상품을 추천
# 다. 동일 차종의 수리 보고서 데이터를 분석하여 차량 수리에 소요되는 시간을 예측
# 라. 상품을 구매할 때 그와 유사한 상품을 구매한 고객들의 구매 데이터를 분석하여 쿠폰을 발행
#
# 1. 나,다
# 2. 가,라
# 3. 가,다
# 4. 나,라
#
# 답 4
#
# 다음 중 연관분석에서 '항목 A를 포함한 거래 중에서 항목A와 항목 B가 같이 포함될 확률은 어느 정도
# 인가를 나타내 주는 연관성의 정도'로 정의되는 측도로 가장 적절한 것은? # 36
#
# 1. 지지도
# 2. 신회도
# 3. 특이도
# 4. 민감도
#
# 답 2
#
# 데이터 프레임 attitude 아래와 같이 R명령을 적용하고 결과를 얻었다. 다음 설명 중 가장 부적절한
# 것은? # 37
#
# 1. 모든 변수들 사이에 양(+)의 상관관계가 존재한다.
# 2. rating과 complaints 사이에 가장 강한 상관관계가 존재한다.
# 3. critical과 learning 사이의 상관관계가 가장 약하다.
# 4. 모든 변수의 분산이 1이다.
#
# 답 4
#
# 아래 에디터는 두종류의 수명유도제(group)에 대해 무작위로 선정된 20명의 환자를 대상으로 수면 시
# 간의 증감(extra)을 측정한 자료이다. 다음 중 결과에 대한 설명으로 가장 부적절한 것은? # 38
#
# 1. 평균적으로 1.54 시간의 수면시간 증가를 가져왔다.
# 2. 3.4 시간 이상 수면이 증가한 환자는 약 25% 이다.
# 3. 모든 환자들의 수면시간이 증가하였다.
# 4. 가장 많이 증가한 수면시간은 5.5시간이다.
#
# 답 3
#
# 아래의 산점도 행렬에 대한 설명으로 가장 부적절한 것은? # 39
# (변수 : Ozone, Solar.R, wind, temp)
#
# 1. temp와 wind 간의 관계는 상대적으로 선형이다.
# 2. Solar.R와 ozine의 관계는 명확하지 않다.
# 3. ozone과 wind 간에는 양의 상관관계가 있다.
# 4. wind와 Solar.R 간에는 비선형 관계가 있다.
#
# 답 3
#
# 다음 중 관대 적합(overfitting)에 대한 설명으로 가장 부적절한 것은? # 40
#
# 1. 과대적합이 발생할 것으로 에상되면 학습을 종료하고 업데이트하는 과정을 반복해 과대적합을 방지
# 할 수 있다.
# 2. 과대적합은 분석 변수가 너무 많이 존재하고 분석 모델이 복잡할 때 발생한다.
# 3. 분석 데이터가 모집단의 특성을 설명하지 못하면 발생한다.
# 4. 생성된 모델은 분석 데이터에 최적화 되었기 때문에 훈련 데이터의 작은 변화에 민감하게 반응하는
# 경우는 발생하지 않는다
#
# 답 4
#
