# 인터넷상의 서버에서 데이터 저장, 처리, 네트워크, 콘텐츠 사용 등 서로 다른 물리적인 위치에 존재하
# 는 컴퓨팅 자원을 가상화 기술을 통해 IT 관련 서비스를 한 번에 제공하는 혁신적인 컴퓨팅 기술은 무
# 엇인가? # 1
#
# 답 클라우드 컴퓨팅
#
# 데이터 사이언스란 데이터로부터 의미 있는 정보를 추출하는 학문이다. 통계학이 정형화된 실험 데이
# 터를 분석 대상으로 하는 것에 비해, 데이터 사이언스는 정형 또는( )을 막론하고 인터넷, 휴대전화, 감
# 시용 카메라 등에서 생성되는 숫자와 문자, 영상 정보 등 다양한 유형의 데이터를 대상으로 한다. # 2
#
# 답 비정형
#
# 풀어야 할 문제에 대한 상세한 설명 및 해당 문제를 해결했을 때 발생하는 효과를 명시함으로써 향후
# 데이터 분석 문제로의 전환 및 적합성 평가에 활용하도록 하는 것은 무엇인가? # 3
#
# 답 분석 유즈 케이스
#
# 아래의 R 명령의 결과를 쓰시오 # 4
#
# 아래
# 0/0
#
# 답 NaN(Not a Number)
#
# 100명의 키를 cm으로 측정한 데이터의 분산이 225였다. 동일한 100명의 키를 m로 측정한다면 데이터
# 분산은 얼마인가? # 5
#
# 답 0.0225
#
# 고객은 늘 구매하지 않는다. 경쟁사의 고객 빼앗기에 따른 고객의 변심 또는 고객의 니즈나 취향이 변
# 해 더 이상 상품과 서비스를 사용하지 않고 경쟁사와 거래하는 고객을 무엇이라고 하는가? # 6
#
# 답 이탈고객
#
# 의사결정나무 중 연속형 타깃변수(또는 목표변수)를 예측하는 의사결정나무를 무엇이라고 하는가? # 7
#
# 답 CART
#
# 데이터마이닝 모델링 분석 기법 중 random input에 따른 forest of tree를 이용한 분류방법으로 랜덤
# 한 forest에는 많은 트리들이 생성된다. 새로운 오브젝트를 분류하기 위해 forest에 있는 트리에 각각
# 투입해 각각의 트리들이 voting함으로써 분류하는 방식의 R 패키지는 무엇인가? # 8
#
# 답 랜덤 포레스트(random forest)
#
# 다수 모델의 예측을 관리하고 조합하는 기술을 메타 학습(meta learning)이라 한다. 여러 분류기(class
# ifier)들의 예측을 조합함으로써 분류 정확성을 향상시키는 기법은? # 9
#
# 답 앙상블 기법
#
# 데이터셋 x는 두 개의 변수와 5개의 관측치를 가지며 아래는 데이터와 관측치 간의 유클리드 거리를
# 나타낸다. 최단연결법을 사용하여 계층적 군집화를 할 때 첫 단계에서 형성되는 군집과 관측치 a와의
# 거리를 구하시오. # 10
#
# > x
# a	1	2
# b	2	1
# c	4	6
# d	4	3
# e	5	1
# > dist(x)
# 	a	b	c	d
# B	3.2
# c	3.6	5.4
# d	3.2	2.8	3.0
# e	5.0	3.0	5.1	2.2
#
# 답 3.2
#
#
#
