# 다음 중 빅데이터 분석에 경제성을 제공해 준 결정적인 기술로 가장 적절한 것은? # 1
#
# 1. 텍스트 마이닝
# 2. 스마트폰의 급속한 확산
# 3. 클라우드 컴퓨팅
# 4. 저장장치 비용의 지속적인 하락
#
# 답 3
#
# 다음 중 데이터 사이언티스트의 소프트스킬로 부적절한 것은? # 2
#
# 1. 이론적 지식
# 2. 창의적 사고
# 3. 설득력 있는 스토리텔링
# 4. 커뮤니케이션 능력
#
# 답 1
#
# 다음 중 데이터 분석 테크닉에 대한 설명 중 가장 부적절한 것은? # 3
#
# 1. 소셜 네트워크 분석은 최근 판테크 기업에서 대출을 제공할 때 활용되고 있다.
# 2. 기계학습은 대규모 데이터를 처리 분석할 때 상당한 분석 인프라와 많은 시간이 소요될 수 있다.
# 3. 한국어의 경우 그 언어적 특성으로 인해 감정 부석에 상대적으로 어려운 측면이 있다.
# 4. 개인의 신용도 평가에 가장 많이 활용되는 것은 연관규칙 학습이다.
#
# 답 4
#
# 다음 중 빅데이터 가치 산정이 어려운 이유로 부적절한 것은? # 4
#
# 1. 기존 데이터를 재사용, 재조합을 통해 새로운 가치를 창출할 수 있다.
# 2. 특정데이터를 언제, 어디서, 누가, 활용하느냐에 따라 가치를 산정할 수 있다.
# 3. 기존에 없던 가치를 창출함에 따라 그 가치를 측정하기 어려워졌다.
# 4. 기존 사업자에게 경재우위를 가져다준다.
#
# 답 4
#
# 다음 중 암묵지와 형식지의 상호작용과 가장 관련이 없는 것은? # 5
#
# 1. 공통화
# 2. 내면화
# 3. 추상화
# 4. 연결화
#
# 답 3
#
# 다음이 설명하는 개인정보 비식별화 기법으로 적절한 것은? # 6
#
# 아래
# 개인 식별에 중요한 데이터를 식별할 수 없는 다른 값으로 변경
#
# 1. 데이터마스킹
# 2. 범주화
# 3. 가명처리
# 4. 총계처리
#
# 답 3
#
# 데이터사이언스는 데이터처리와 관련된 IT영역, 분석적 영역, 그리고 비즈니스 컨설팅 영역을 포괄하고
# 있다. 다음 중 세 개의 영역과 다른 영역에 속하는 하나는? # 7
#
# 1. 데이터웨어하우징
# 2. 데이터 시각화
# 3. 분산컴퓨팅
# 4. 파이썬 프로그래밍
#
# 답 2
#
# 빅데이터와 데이터 사이언스에 대한 설명으로 부적절한 것은? # 8
#
# 1. 기업의 빅데이터 분석은 기업 분석 문화의 영향을 받는다.
# 2. 미래 가치 패러다임의 변화에서 빅데이터 분석 활용 능력은 핵심적인 역할을 한다.
# 3. 데이터 사이언스에서 시각화와 효과적인 커뮤니케이션은 중요한 요소이다.
# 4. 데이터 사이언스는 정형화된 실험데이터를 대상으로 한다.
#
# 답 4
#
# 다음 중 데이터 분석 과제에서 프로젝트 관리에 대한 설명으로 가장 부적절한 것은? # 9
#
# 1. 분석 과제는 분석 전문가의 상상력을 요구하므로 일정을 제한하는 일정계획은 적절하지 못하다.
# 2. 분석 과제는 많은 위험이 있어 사전에 위험을 식별하고 대응방안을 수립해야 한다.
# 3. 분석 과제는 적용되는 알고리즘에 따라 범위가 변할수 있어 범위관리가 중요하다.
# 4. 분석과제에서 다양한 데이터를 확보하는 경우가 있어 조달관리또한 중요하다.
#
# 답 1
#
# 다음 중  마스터 플랜을 수립할 때 우선순위 고려요소로 가장 적절하지 않은 것은? # 10
#
# 1. 전략적 중요도
# 2. 제이터 우선 순위
# 3. 실행 용이성
# 4. 비즈니스 성과/ROI
#
# 답 2
#
#
