# 다음 중 분석 기회 발굴의 범위 확장시 경쟁자 확대 관점으로 보았을 때 포함되는 영역으로 가장 적절
# 하지 않은 것은? # 11
#
# 1. 대체제
# 2. 경쟁자
# 3. 경쟁 채널 모델
# 4. 신규 진입자
#
# 답 3
#
# 데이터 표준화에 대한 설명으로 가장 적절한 것은? # 12
#
# 1. 데이터 표준화란 데이터 정합성 및 활용의 효율성을 위하여 표준 데이터를 포함한 메타 데이터와
# 데이터 사전의 관리 원칙을 수립하는 것이다.
# 2. 데이터 표준 용어 설정, 명명 규칙 수립, 메타 데이터 구축, 데이터 사전 구축 등의 업무로 구성된다.
# 3. 메타데이터 및 표준데이터를 관리하기 위한 전사 차원의 저장소를 구축하는 것이다.
# 4. 데이터 거버넌스 체계를 구축한 ㅅ후 표준 준수 여부를 주기적으로 점검하고 모니터링 하는 것이다.
#
# 답 2
#
# 분석 기회 발굴의 범위를 확장할 때에 고려해야 하는 내용으로 부적절한 것을 고르시오. # 13
#
# 1. 거시적 관점의 메가트랜드에서는 현재의 조직 및 해당 산업에 폭넓게 영향을 미치는 사회·기술·경제·
# 환경·정치 영역으로 나누어서 좀 더 폭넓게 기회 탐색을 수행한다.
# 2. 시장의 니즈 탐색 관점에서는 현재 수행하고 있는 사업에서의 직접 고객뿐만 아니라 고객과 접촉하
# 는 역할을 수행하는 채널 및 고객의 구매와 이사결정에 영향을 미치는 영향자들에 대한 폭넓은 관점을
# 바탕으로 분석 기회를 탐색한다.
# 3. 경쟁자 확대 관점에서는 현재 수행하고 있는 사업 영역의 직접 경쟁사 및 제품/서비스만 아니라 대
# 체재와 신규 진입자 등으로 관점을 확대하여 탐색한다.
# 4. 역량의 재해석 관점에서는 내부 역량보다는 파트너와 네트워크를 집중적으로 분석하여 분석기회를
# 탐색한다.
#
# 답 4
#
# 빅데이터 가치에 대해 재해석이 어려운 이유로 가장 틀린 것은? # 14
#
# 1. 자사의 내부 지적재산권
# 2. 자사가 갖고 있는 노하우 및 인프라에 대한 폭넓은 이해
# 3. 파트너가 갖고 있는 정보에 대한 폭넓은 이해
# 4. 파트너가 갖고 있는 네트워크를 활용한 새로운 정보이해
#
# 답 1
#
# 다음 중 분석과제 발굴에 대한 설명으로 가장 부적절한 것은? # 15
#
# 1. 분석해야 할 대상이 명확하다면 상향식 접근방식이 적절하다.
# 2. 문제가 주어지고 이에 대한 해법을 찾기 위하여 각 과정이 체게적으로 단계화되어 수행되는 방식이
# 하향식 접근 방식이다.
# 3. 데이터를 활용하여 인사이트를 도출하는 상향식 접근 방식의 유용성이 점차 증가되고 있다.
# 4. 디자인 사고 프로세스는 발산 단계와 수렴단계를 반복적으로 수행하는 방법으로 분석과제 발굴에
# 유용하게 활용될 수 있다.
#
# 답 1
#
# 다음 중 빅데이터 분석 방법론 중 시스템 구현에 대한 설명 중 가장 부적절한 것은? # 16
#
# 1. 시스템 구현단계에는 설계 및 구현, 시스템 테스트 및 운영으로 이루어져 있다.
# 2. 시스템 설계서를 바탕으로 BI 패키지를 활용하거나 새롭게 프로그램 코딩을 통하여 시스템을 구축
# 한다.
# 3. 정보 보호 및 시스템 성능은 시스템 구현 단계에 해당되지 않는다.
# 4. 정보보안영역과 코딩은 시스템 구현 단계에서 주요 고려사항이다.
#
# 답 4
#
# 다음이 설명하는 표본 추출 방법은 무엇인가? # 17
#
# 아래
# 번호를 부여한 샘플을 나열하여 K개씩 n개의 구간으로 나누고, 첫 구간(1,2,3,···,K)에서 하나를 임의로
# 선택한 후에 K개씩 띄어서 n개의 표본을 선택한다. 즉, 임의 위치에서 매 k번째 항목을 추출하는 방법
# 이다.
#
# 1. 계통추출법
# 2. 집락추출법
# 3. 층화추출법
# 4. 단순랜덤추출법
#
# 답 1
#
# 아래는 결과를 생성한 잔차도이다. 다음 중 어떤 회귀분석의 가정이 위배되었다고 판단할 수 있을지 고
# 르시오. # 18
#
# 1. 비정규성
# 2. 독립성
# 3. 선형성
# 4. 정상성
#
# 답 3
#
# 여섯 가지 종류의 닭 사료 첨가물의 효과를 비교하기 위한 데이터와 그래프이다. 아래에 대한 설명으로
# 부적절한 것은 무엇인가? # 19
#
# 아래
# >summary(chickwts)
# weight		feed
# Min	:108.0	casein	:12
# 1st Qu.	:204.5	horsebean:10
# Median	:258.0	linseed	:12
# Mean	:261.3	meatmeal:11
# 3rd Qu.	:323.5	soybean	:14
# Max.	:423.0	sunflower:12
#
# 1. Weight의 중앙값은 horsebean 그룹이 가장 작다.
# 2. 이상값이 존재하지 않는다.
# 3. Meatmeal 그룹과 Linseed 그룹의 Weight의 평균이 유의한 차이가 있는지 알 수 없다.
# 4. Horsbean 그룹에서 Weight가 150보다 작은 개체가 약 50% 가량 된다.
#
# 답 2
#
# A, B로 구성된 데이터 1,000개 중 결측치 비율이 각각 5%라고 한다. 독립인 A, B 데이터의 결측값을 제
# 거한다고 할 때 삭제되는 데이터 비율로 가장 알맞은 것은? # 20
#
# 1. 0.0025%
# 2. 9.75%
# 3. 20%
# 4. 25%
#
# 답 2
#
