# 다음 중 분류분석이 이용되는 기법으로 가장 틀린 것은? # 21
#
# 1. 연관분석
# 2. 로지스틱 회귀분석
# 3. 인공신경망분석
# 4. 의사결정나무
#
# 답 1
#
# 다음 데이터셋 A, B 간의 유클리드 거리의 계산하면? # 22
#
# 아래
#
# 	A	B
# 키	175	180
# 몸무게	45	50
#
# 1. 0
# 2. √5
# 3. √25
# 4. √50
#
# 답 4
#
# 빵을 구매할 때 버터를 구매할 확률에 대한 연관규칙으로 알맞은 측도와 그 값을 고르시오. # 23
#
# 아래
#
# Transcation 1	{빵,버터}
# Transcation 2	{맥주,버터,빵}
# Transcation 3	{젤리,쥬스}
# Transcation 4	{빵,맥주,젤리}
# Transcation 5	{빵,버터,쥬스}
#
# 답 2
#
# 다음 중 시그모이드 활성함수 식으로 옳은 것은? # 24
#
# 1. 1/1+exp(-z)
# 2. ?
# 3. exp(z)-exp(-z)/exp(z)+exp(-z)
# 4. y=exp(-z**2/2)
#
# 답 1
#
# EM 알고리즘을 사용하여 혼합분포 모형을 추정하고자 한다. 아래와 같은 그래프가 도출되었을 때, 다
# 음 중 가장 적절한 해석은? # 25
#
# 1. 반복회수 2회만에 로그-가속도 함수가 최대가 되었다.
# 2. 정규혼합분포가 2가지로 관찰되었다.
# 3. 모수의 추정을 위해 10회 이상의 반복횟수가 필요하다.
# 4. 로그-가능도 함수의 최소값이 -1040이다.
#
# 답 1
#
# 아래는 최적 회귀방적실을 도출하기 위해 관련된 변수들을 사용하여 얻은 결과이다. 아래의 결과물에
# 관한 설명으로 가장 부적절한 것은? # 26
#
# 1. 후진제거법을 사용한 결과이다.
# 2. 최종 결과의 독립변수는 4개이다
# 3. 설명변수 중 X2가 가장 먼저 제거된다.
# 4. 하나의 변수가 제거되었을 경우의 AIC 값이제거되기 이전의 AIC값보다 낮아지면 해당 변수를 제거
# 하는 방식이다.
#
# 답 1
#
# 다음 t.test결과 해석에 대한 내용으로 틀린 것은? # 27
#
# 1. 전체 관측치는 260개이다.
# 2. weight값의 95% 신뢰구간은 242.8~279.8이다.
# 3. weight가 260이 아니라는 대립가설을 기각한다.
# 4. weight의 점추정값은 261.3 이다.
#
# 답 1
#
# 다음 중 이상값 자료에 민감한 k평균 군집의 단점을 보완하기 위해 평균 대신 사용되는 것으로 적절한
# 것은? # 28
#
# 1. 중앙값
# 2. 최대값
# 3. 조화평균
# 4. 가중평균
#
# 답 1
#
# k-평균 군집으로 대표되는 비계층적 군집 방법에서는 군집의 개수인 k를 미리 정해주어야 한다. 다음
# 중 군집수를 정하는 데 활용할 수 있는 그래프로 가장 적절한 것은 무엇인가? # 29
#
# 1. ROC 그래프
# 2. 향상도 곡선
# 3. 오차 제곱합
# 4. 집단 내 제곱합
#
# 답 4
#
# 다음 중 결측치에 대한 설명으로 가장 부적절한 것은? # 30
#
# 1. 해당 칸이 비어있는 경우 결측치 여부는 알기 쉽다.
# 2. 관측치가 있지만 실상은 default 값이 기록된 경우에도 결측치로 처리해야 하는 것이 바람직하다.
# 3. 결측치가 있는 경우 다양한 대치(Imputation)방법을 사용하여 완전한 자료로 만든 후 분석을 진행
# 할 수 있다.
# 4. 결측치가 20% 이상인 경우에는 해당 변수를 제거하고 분석해야 한다.
#
# 답 2
#
