# 로지스틱 회귀모형은 독립변수(x)와 종속변수(y) 사이의 관계를 설명하는 모형으로서 종속변수가 범주
# 형(y=0 또는y=1)값을 갖는 경우에 사용하는 방법이다. 다음 중 로지스틱 회귀모형에 대한 설명으로
# 가장 부적절한 것은? # 31
#
# 1. 이러한 데이터에 대해 선형회귀모형을 적용하는 것이 기술적으로 가능하지만, 선형회귀의 문제점은
# 0이하의 값이나 1이상의 값을 예측값으로 줄 수 있다는 것이며 따라서 이를 확률값으로 직접 해석할
# 수 없다.
# 2. 로지스틱 회귀모형은 클래스가 알려진 데이터에서 설명변수들의 관점에서 각 클래스내의 관측처들
# 에 대한 유사성을 찾는데 사용할 수 있다.
# 3. 종속변수 y 대신 로짓(logit)을 사용하여 설명변수들의 선형함수로 모형화하기 때문에 이 모형을 로
# 지스틱 회귀모형이라고 한다.
# 4. Odds(오즈)란 클래스0에 속할 확률(1-p)이 클래스 1에 속할 확률 p의 비로 나타낸다. 즉,
# Odds=p/(1-p)로 나타낸다.
#
# 답 2
#
# 다음 중 판별분석에 대한 설명 중 틀린 것은? # 32
#
# 1. 거리 측정을 위해 피어슨 상관계수를 이용하고 구분선이 평균대비 거리가 동일하다.
# 2. 로지스틱 회귀분석과 비슷하며 프로파일링에 사용되는 분석이다.
# 3. 고객 그룹을 나누거나 자연과학, 금융, 마케팅 등에 활용된다.
# 4. 판별분석에서는 선형 분류함수를 적용해야하며, 피셔의 선형 분류함수 등이 있다.
#
# 답 1
#
# 주성분분석은 p개의 변수들을 중요한 m(p)개의 주성분으로 표현하여 전체 변동을 설명하는 방법을
# 사용한다. 다음 중 주성분 개수(m)를 선택 방법에 대한 설명으로 가장 부적절한 것은? # 33
#
# 1. 전체 변이 공헌도(percentage of total variance) 방법은 전체 변이의 70~90% 정도가 되도록 주성분
# 의 수를 결정한다.
# 2. 평균 고유값(average eigenvalue)방법은 고유값들의 평균을 구한 후 고유값이 평균값 이상이 되는
# 주성분을 제거하는 방법이다.
# 3. Scree graph를 이용하는 방법은 고유값의 크기순으로 산점도를 그린 그래프에서 감소하는 추세가
# 원만해지는 지점에서 1을 뺀 개수를 주성분의 개수로 선택한다.
# 4. 주성분은 주성분을 구성하는 변수들의 계수 구조를 파악하여 적절하게 해석되어야 하며, 명확하게
# 정의된 해석 방법이 있는 것은 아니다.
#
# 답 2
#
# 아래는 다섯 종류의 오렌지 나무(Tree)에 대해서 연력(age)과 둘레(cricumference)를 측정한 자료이다.
# 아래의 결과물에 대한 설명으로 가장 부적절한 것은? # 34
#
# 1. age는 Tree별로 평균이 유의한 차이가 없다고 할 수 있다.
# 2. age의 평균은 922.1이다.
# 3. 35개의 관측치를 포함하고 있다.
# 4. 약 50%의 나무가 115보다 큰 둘레를 가지고 있다.
#
# 답 1
#
# 다음 중 누적분포함수에 대한 설명 중 가장 부적절한 것은? # 35
#
# 1. a<x<=b라는 구간사건의 확률을 누적분포함수로 표현하면 P(a,b)=F(b)-F(a)이다.
# 2. 누적분포함수는 non-decreasing function이며, 우측 연속이다.
# 3. 모든 확률변수에 대해 확률밀도(질량)함수는 존재하지만, 누적분포함수가 존재하지 않는 확률변수도
# 있다.
# 4. 확률변수 X의 누적분포 함수 중, 연속형 확률 변수는 적분을 통해 구할 수 있다.
#
# 답 3
#
# 과대적합(overfitting)은 통계나 기계학습에서 모델의 변수가 너무 많아 모델이 복잡하고 과대하게 학습
# 될 때 주로 발생한다. 다음 중 과대 적합에 대한 설명으로 가장 부적절한 것은? # 36
#
# 1. 생성된 모델이 훈련 데이터에 너무 최적화되어 학습하여 테스트 데이터의 작은 변화에 민감하게 반
# 응하는 경우는 발생하지 않는다.
# 2. 변수가 너무 많아 모형이 복잡할 때 생긴다.
# 3. 과대적합이 발생할 것으로 예상되면 학습을 종료하고 업데이트하는 과정을 반복해 과대적합을 방지
# 할 수 있다.
# 4. 학습데이터가 모집단의 특성을 충분히 설명하지 못할 때 자주 발생한다.
#
# 답 1
#
# 아래는 스위스 내 47개의 프랑스어 사용 지역에서의 출산율과 관련된 변수들을 사용하여 그린 그림이
# 다. 다음 중 시각화 자료에 대한 설명으로 가장 부적절한 것은? # 37
#
# 1. 출산율(Fertility)은 시험(Examination)과 가장 높은 음의 상관관계를 가진다.
# 2. 시험(Examination)과 가장 상관관계가 높은 변수는 교육수준(Education)이다.
# 3. 교육수준(Education)이 높을수록 출산율(Fertility)은 낮아진다.
# 4. 출산율(Fertility)과 농업인구 비율(Agriculture)은 선형관계를 보인다.
#
# 답 1
#
# 아래는 스위스의 47개 프랑스어 사용지역의 출산율(Fertility)과 관련된 변수들을 사용하여 얻은 결과이
# 다. 회귀모형에 관한 다음 설명 중 가장 부적절한 것은? # 38
#
# 1. 유의수준 0.05하에서 위의 회귀모형은 유의적으로 출산율을 설명한다.
# 2. 위의 회귀모형은 출산율 변동의 70.67%를 설명한다.
# 3. 독립변수는 총 5개이다.
# 4. 위의 결과에서 y절편이 0이 아니라는 증거는 알 수 없다.
#
# 답 4
#
# College 데이터 프레임은 777개 미국 소재 대학의 각종 통계치를 포함하고 있고 Books 변수(단위:달러)
# 는 평균적인 교재구입비용을 말한다. 미국 전체 대학의 평균 교재비용에 대해 추론하려 할 때, 아래의
# 결과에 대한 설명으로 다음중 적절하지 않은 것은 무엇인가? # 39
#
# 1. 777개 대학위 평균 교재구입비용은 549.38달러이다.
# 2. 대학의 평균 교재구입비용에 대한 점추정량은 549.38달러이다.
# 3. 대학의 평균 교재구입비용이 570달러와 같다는 가설이 기각되지 않는다.
# 4. 대학의 평균 교재구입비용이 95% 신뢰구간은 (537.75,561.01)이다.
#
# 답 3
#
# 다음 시계열 분석의 기초가 되는 개념인 정상성(Stationarity)의 특징에 관한 설명이다. 설명이 옳지 않
# 은 것은? # 40
#
# 1. 시계열 분석에서 비정상 시계열 자료는 시계열 분석을 할 수 없다.
# 2. 분산도 시점에 의존하지 않는다.
# 3. 평균이 일정하다. 즉 모든 시점에 대한 일정한 평균을 가진다.
# 4. 공분산은 단지 시차에만 의존하고 실제 어느 시점t,s에는 의존하지 않는다.
#
# 답 1
#
#
