# 다음 내용이 설명하고 있는 빅데이터의 역할로 알맞은 것은? # 1
#
# 아래
# 이것은 비즈니스 측면에서 일반적으로 '공동 활용의 목적으로 구축된 유무형의 구조물을' 의미한다.
# 각종 사용자 데이터나 M2M센서 등에서 수집된 데이터를 가공·처리·저장해두고 이 데이터에 접근할 수
# 있도록 API(Application Program Interface)를 공개한다. 그러면 다양한 서드파티(3rd-party)사업자들이
# 비즈니스에 필요한 정보를 추출해 활용하게 되고 빅데이터는 그 자체로 이 역할을 수행하게 된다.
#
# 답 플랫폼
#
# 아래에 설명한 빅데이터 활용테크닉은 무엇인가? # 2
#
# 아래
# 데이터의 가공 및 상관관계간 이해를 통해 패턴을 인식하고 그 의미를 부여한 데이터로 지식을 추출하
# 기 위한 것이다.
#
# 답 정보
#
# 아래( )안에 들어갈 용어로 적절한 것은? # 3
#
# 아래
# 데이터 표준화는 데이터표준 용어 설정, 명명규칙(name rule)수립,( )구축, 데이터 사전(Data Dictionary)
# 구축 등의 업무로 구성된다. 데이터 표준 단어 사전, 표준 도메인사전, 표준 코드 등으로 구성되며 사전
# 간 상호 검증이 가능하도록 점검 프로세스를 포함해야 한다.
#
# 답 메타데이터
#
# 다음 중 빈칸에 공통으로 들어갈 알맞은 단어를 적으시오. # 4
#
# 아래
# ( )란 전사차원의 모든 데이터에 대하여 정책 및 지침, 표준화, 운용조직 및 책임등의 표준화된 관리체
# 계를 수립하고 운영을 위한 프레임워크(Framework) 및 저장소(Repository)를 구축하는 것을 말한다.
# 특히 마스터 데이터(Master Data), 메타 데이터(Meta Data), 데이터 사전(Data Dictionary)은 ( )의 중
# 요한 관리 대상이다.
#
# 답 데이터 거버넌스
#
# 다음 내용이 설명하고 있는 단어를 적으시오. # 5
#
# 아래
# 이것은 배깅에 랜덤과정을 추가한 방법이다. 원 자료로부터 붓스트랩 샘플을 추출하고, 각 붓스트랩
# 샘플에 대해 트리를 형성해 나가는 과정은 배깅과 유사하나, 각 노드마다 모두 예측변수 안에서 최적의
# 분할을 선택하는 방법 대신 예측변수를 임의로 추출하고 추출된 변수 내에서 최적의 분할을 만들어 나
# 가는 방법을 사용 한다.
#
# 답 랜덤 포레스트
#
# 두 객체 간의 거리에 기반하여 군집을 형성해가는 계층적 군집방법에서 사용되는 측도 중 두 개체의 벡
# 터 내적을 기반하여 아래의 수식으로 계산할 수 있는 유사성 측도는 무엇인가? # 6
#
# 답 코사인 유사도
#
# 다음 내용이 설명하고 있는 단어를 적으시오
#
# 아래
# 코호넨에 의해 제시되었으며, 비지도 신경망으로 고차원의 데이터를 이해하기 쉬운 저차원의 뉴런으로
# 정렬하여 지도의 형태로 형상화하는 클러스터링 방법은 무엇인가? # 7
#
# 답 SOM
#
# 다음 내용이 설명하고 있는 그래프를 적으시오. # 8
#
# 아래
# 레이터 이미지 분석의 성과를 측정하기 위해 개발된 이 그래프는 두 분류 분석 모형을 비교 분석 결과
# 를 가시화 할 수 있다는 점에서 유용한 평가도구이다. X축에는 FP Ratio(1-x특이도)를 나타내며 y축에
# 는 민감도를 나타내 우 평가 값의 관계로 모형을 평가한다. 모형의 성과를 평가하는 기준은 그래프의
# 밑 부분 면적을 넓을수록 좋은 모형으로 평가한다.
#
# 답 ROC Curve
#
# 다음 표에서(a)-(d)를 사용하여 정분류울(Accuracy)를 표현하시오. # 9
#
# 아래
#
# 		예	측	값
#
# 		True		False
# 실제값	True	a		b
# 실제값	False	c		d
#
# 답 a+d/a+b+c+d
#
# 다음 내용이 설명하고 있는 것을 적으시오. # 10
#
# 아래
# - 시계열 모델 중 자기 자신의 과거 값을 사용하여 설명하는 모형임
# - 백색 잡음의 현재값과 자리 자신의 과거값의 선형 가중합으로 이루어진 정상확률 모형
# - 모형에 사용하는 시계열 자료의 시점에 따라 1차,2차,...p차 등을 사용하나 정상시계열 모형에서는 주
# 로 1,2차를 사용함
#
# 답 AR모형
#
