# 데이터베이스의 특징으로 가장 부적절한 것은? # 1
#
# 1. 데이터베이스는 여러 사용자가 서로 다른 목적으로 데이터를 공동으로 이용할 수 있도록 구성되어
# 있다.
# 2. 데이터베이스는 통합된 데이터(integrated data)다.
# 3. 데이터베이스는 변화하는 데이터로 데이터의 삽입, 삭제, 갱신을 한다고 하더라도 항상 현재의 정확
# 한 데이터를 유지해야 한다.
# 4. 데이터베이스는 검색기능을 가지고 있으므로 다양한 방법으로 필요한 정보를 검색할 수 있다.
#
# 답  4
#
# DIKW 피라미드의 계층 중 "B마트 보다 상대적으로 저렴한 A마트에서 연픽을 사야겠다."의 내용에
# 해당하는 계층은 무엇인가? # 2
#
# 1. 지혜
# 2. 지식
# 3. 정보
# 4. 데이터
#
# 답 2
#
# 다음 중 데이터 사이언티스트(data scientist)에게 요구되는 소프트 역량(soft skill)이 아닌 것은? # 3
#
# 1. 이론적 지식
# 2. 창의적 사고
# 3. 커뮤니케이션 기술
# 4. 비쥬얼라이제이션을 활용한 설득력
#
# 답 1
#
# 다음 중 빅데이터 분석에 경제성을 제공해 준 결정적인 기술로 가장 적절한 것은? # 4
#
# 1. 저장장치 비용의 지속적인 하락
# 2. 텍스트 마이닝
# 3. 클라우드 켬퓨팅
# 4. 스마트폰의 급속한 확산
#
# 답 3
#
# 아래와 같은 SQL문장을 사용할 때, 출력되는 결과로 옳은 것은? # 5
#
# 아래
# select customer_name 고객명, e_customer_name 고객 영문명
# from customer
# where e_customer_name like '_A%';
#
# 1. 영문명이 A로 시작하는 고객들의 이름
# 2. 영문명에 A를 포함한 고객들의 비율
# 3. 위치 상관없이 영문명에 A를 포함하는 고객들의 이름
# 4. 영문명에 두 번째 문자가 A인 고객들의 이름
#
# 답 4
#
# 인터넷 등 각종 경로로 정보를 수집하는 구글은 이미 지난 2010년에 서비스 이용자가 1시간 뒤에
# 어떤 일을 할지 87% 정확도로 예측할 수 있는 데이터와 분석 신뢰도를 확보하고 있다고 했다.
# 또, 여행사실을 트위트한 사람의 집을 강도가 노리는 고전적 사례도 발생했다. 이러한 사례를 통해
# 알 수 있는 빅데이터 시대의 위기 요인으로 적절한 것은? # 6
#
# 1. 소셜 네트워크
# 2. 책임 원칙 훼손
# 3. 데이터 오용
# 4. 사생활 침해
#
# 답 4
#
# 사물끼리 정보를 주고 받는 시뮬인터넷 시대를 빅데이터의 관점에서 바라볼 때 다음 중 사물인터넷의
# 의미로 가장 적절한 것은? # 7
#
# 1. 모든 것의 데이터화(datafication)
# 2. 서비스 지능화(intelligent service)
# 3. 분석 고급화(advanced analytics)
# 4. 정보 공유화(information sharing)
#
# 답 1
#
# 빅데이터와 데이터 사이언스의 미래를 위한 외무 환경적 측면에서 인문학의 열풍의 원인을 설명한 것
# 중 옳지 않은 것은? # 8
#
# 1. 단순세계화에서 복잡한 세계화로 변화하는 과정에서 인문학의 중요성을 인식하여야 한다.
# 2. 비즈니스의 화두가 글로벌 네트워크를 통한 대량공급으로 변함에 따라 가격 인하 정책의 성공을
# 위해서는 인문학이 중요하다.
# 3. 비즈니스 중심이 제품생산에서 서비스로 이동함에 따라 인문학의 중요성이 증가하고 있다.
# 4. 경제와 산업의 논리가 생산에서 시장 참조로 변화하면서 인문학의 중요성이 증가하고 있다.
#
# 답 2
#
# 분석은 분석의 대상(What) 및 분석의 방법(How)에 따라 4가지 분석 주제로 나눌 수 있다.
# 분석의 대상이 명확하게 무엇인지 모르면서 기존 분석 방법으로 새로운 분석을 수행하는 방식의 분석
# 주제 유형은 무엇인가? # 9
#
# 1. 최적화(Optimization)
# 2. 통찰(Insight)
# 3. 솔루션(Solution)
# 4. 발견(Discovery)
#
# 답 2
#
# 다음 중 성공적인 분석을 위해서 고려해야 할 요소로 가장 부적절한 것은? # 10
#
# 1. 분석 데이터에 대한 고려
# 2. 활용 가능한 유즈케이스 탐색
# 3. 원점에서 솔루션 탐색
# 4. 장애 요소에 대한 사전 계획 수립
#
# 답 3
#
#
