# 분석 과제를 발굴하기 위한 접근법 중 하향식 접근방법의 과정이 아닌 것은? # 11
#
# 1. 기업의 내/외부 환경을 포괄하는 비즈니스 모델과 외부 사례를 기반으로 문제를 탐색
# 2. 기업내부의 과거 데이터를 무조건 결합 및 활용한다.
# 3. 식별된 비즈니스 문제를 데이터의 문제로 변화하여 정의한다.
# 4. 도출된 분석 문제나 가설에 대한 대안을 과제화하기 위해 타당성을 평가한다.
#
# 답 2
#
# 분석기회 발굴의 범위 중 시장니스 탐색 관점에서 고객 니즈의 변화에 해당하는 것이 아닌 것은? # 12
#
# 1. 고객
# 2. 채널
# 3. 영향자들
# 4. 대체제
#
# 답 4
#
# 거시적 관점의 메가 트랜드에서 현재의 조직과 해당 산업에 폭넓게 영향을 미치는 사회ㆍ경제적요인
# 인 STEEP로 폭넓게 기회를 탐색한다. STEEP 중 Political(정치영역)의 주요관점에 대한 설명으로 가장
# 적절한 것은? # 13
#
# 1. 주요 정책방향, 정세, 지정학적 동향 등 거시적인 흐름을 토대로 분석기회를 도출한다.
# 2. 산업과 경제 구조 변화 동향에 따른 시장의 흐름을 파악하여 분석기회를 도출한다.
# 3. 정부, 사회단체, 시민사회의 환경에 관한 관심과 규제 동향을 파악하여 분석기회를 도출한다.
# 4. 과학, 기술, 의학 등 최신 기술의 등장 및 변화를 파악하여 분석기회를 도출한다.
#
# 답 1
#
# 분석 프로젝트 영역별 주요 관리 항목이 아닌 것은? # 14
#
# 1. 품질
# 2. 시간
# 3. 가격
# 4. 자원
#
# 답 3
#
# 다음 중 분석 과제 관리 프로세스에 대한 설명으로 가장 적절하지 않은 것은 무엇인가? # 15
#
# 1. 분석 아이디어 발굴, 분석과제 후보제안, 분석과제 확정 푸로세스는 과제 발굴 단계에 속해 있다.
# 2. 분석과제로 확정되면 분석 과제를 풀(pool)로 관리한다.
# 3. 분석과제 중에 발생된 시사점과 분석 결과물은 풀(pool)로 관리하고 공유된다.
# 4. 과제 수행 단계에서는 팀 구성, 분석과제 식별, 분석과제 진행관리, 결과 공유 프로세스가 있다.
#
# 답 2
#
# 다음 데이터 분석 조직의 유형 중 별도의 분석 조직이 없고 해당 업무부서에서 분석을 수행하는 방식
# 에 해당하는 것은? # 16
#
# 1. 기능형
# 2. 분산형
# 3. 복합형
# 4. 집중형
#
# 답 1
#
# 모형을 개발하여 운영상황에서 실제 테스트를 할 때 모형 개발 데이터를 통해서는 높은 적중률을 보이
# 지만 테스트 데이터에서는 적중률이 떨어져 적중률을 유지하지 못하는 것을 무엇이라고 하는가? # 17
#
# 1. 일반화
# 2. 과대적함
# 3. 미적합
# 4. 과소평가
#
# 답 2
#
# 측정대상이 갖고 있는 속성의 양을 측정하는 것으로 측정결과가 숫자로 표현되나 해당 속성이 전혀
# 없는 상태인 절대적인 영점이 없어 두 관측 값 사이의 비율은 별 의미가 없게 된다. 온도, 지수 등이
# 해당되는 이 척도는 무엇인가? # 18
#
# 1. 명목척도
# 2. 순서척도
# 3. 구간척도
# 4. 비율척도
#
# 답 3
#
# 다음 중 아래의 R코드를 수행한 결과에 대한 설명으로 옳은 것은? # 19
#
# 아래
# > c(2, 4, 6, 8) + c(1, 3, 5, 7, 9)
#
# 1. 경고 메시지와 함께 결과가 출력된다.
# 2. 4개의 숫자로 이루어진 벡터가 출력된다.
# 3. 9개의 숫자로 이루어진 벡터가 출력된다.
# 4. 에러 메시지가 출력되고, 명령 수행이 중단된다.
#
# 답 1
#
# 다음 중 모분산의 추론에 대한 설명으로 적절하지 않은 것은 무엇인가? # 20
#
# 1. 이표본에 의한 분산비 검정은 두 표본의 분산이 동일한지를 비교하는 검정으로 검정통계량은 F분포
# 를 따른다.
# 2. 모분산이 추론의 대상이 되는 경우는 모집단의 변동성 또는 퍼짐의 정도에 관심이 있을 때이다.
# 3. 모집단이 정규분포를 따르지 않더라도 중심극한 정리를 통해 정규 모집단으로부터의 모분산에 대한
# 검정을 유사하게 시행할 수 있다.
# 4. 평균모집단에서 n개를 단순임의 추출한 표본의 분산은 자유도가 n-1 인 t 분포를 따른다.
#
# 답 4
