# 다음 중 다중회귀분석을 위해 사용되는 변수선택방법에 대한 설명 중 변수선택방법과 설명이 잘못 연
# 결되어 있는 것은? # 21
#
# 1. 전진선택법(forward selection)은 상수항만 포함된 모형에서 출발하여 설명력이 좋은 변수를 하나씩
# 추가하는 방법이다.
# 2. 단계적 방법(stepwise method)은 설명력이 나쁜 변수를 제거하거나 모형에서 제외된 변수 중 모형
# 의 설명력을 가장 잘 개선하는 변수를 추가하는 방법이다.
# 3. 후진제거법(backward elimination)은 모든 변수가 포함된 모형에서 설명력이 나쁜 변수를 하나씩
# 제거하는 방법이다.
# 4 최적선택법(optimum selection)은 전진선택법과 후진제거법을 결합한 방법으로 회귀식이 최적의
# 변수를 선택하도록 하는 방법이다.
#
# 답 4
#
# 이상치를 찾는 것은 데이터 분석에서 데이터 전처리를 어떻게 할지 검정할 때 사용할 수 있다. 다음
# 중 상자그림을 이용하여 이상치를 판정하는 방법에 대한 설명으로 가장 부적절한 것은? # 22
#
# 1. IQR=Q3-Q1 이라고 할 때, Q1-1.5*IQR<x<Q3+1.5*IQR을 벗어나는 x를 이상치라고 규정한다.
# 2. 평균으로부터 3*표준편차 범위를 벗어나는 것들을 비정상이라 규정하고 제거한다.
# 3. 이상치는 변수의 분포에서 벗어난 값으로 상자 그림을 통해 확인할 수 있다.
# 4. 이상치는 분포를 왜곡할 수 있으나 실제 오류인자인지에 대해서는 통계적으로 판단하지 못하기 때
# 문에 제거여부는 실무자들을 통해서 결정하는 것이 바람직하다.
#
# 답 2
#
# 통계분석에서 자료를 수집하고 그 수집된 자료로부터 어떤 정보를 얻고자 하는 경우에는 항상 수집된
# 자료가 특정한 확률분포를 따른다고 가정한다. 다음 중 연속형 확률분포가 아닌 것은? # 23
#
# 1. 이항분포
# 2. 정규분포
# 3. T분포
# 4. F분포
#
# 답 1
#
# 다음 표본 추출 방법에 관한 설명 중 잘못된 것은 무엇인가? # 24
#
# 1. 표본의 크기를 결정할 때 가장 중요한 부분은 표본이 모집단을 얼마나 설명하는지에 대한 대표성의
# 확보이다.
# 2. 단순랜덤추출법은 모집단에서 샘플을 뽑을 때 각각의 샘플이 모두 동등한 확률을 가지고 무작위로
# 추출되는 방법이다.
# 3. 계통추출법은 모집단을 군집으로 구분하고 선정된 군집의 원소를 모두 샘플로 추출하는 다단계 방
# 법이다.
# 4. 층화추출법은 모집단을 몇 개의 집단으로 구분하고, 각 집단의 크기와 분산을 고려하여 각 집단마
# 다 샘플을 추출하는 방법이다.
#
# 답 3
#
# 다음 중 비모수겁정이 아닌 것을 고르시오. # 25
#
# 1. 윌콕슨의 순위합검증
# 2. 만-위트니의 U겁정
# 3. 스피어만의 순위상관계수
# 4. 자기상관검증
#
# 답 4
#
# 두 변장 X, Y의 상관분석에 관한 내용이다. 설명이 옳지 않은 것은? # 26
#
# 1. 등간척도로 측정된 두 변수간의 상관관계는 피어슨 상관계수(Pearson correlation)를 통해 확인할
# 수 있다.
# 2. 상관계수가 0이면 두 변량 X, Y사이에 선형관계가 없다.
# 3. 서열척도로 측정된 두 변수간의 상관관계는 스피어만 상관계수(Spearman correlation)를 통해 확인
# 할 수 있다.
# 4. R에서 상관계수를 구하기 위해서는 rcor()함수를 사용하면 되고 type인자를 통해 피어슨과 스피어
# 만 상관계수를 선택할 수 있다.
#
# 답 4
#
# 다음 중 회귀분석에서 나온 결정계수 (R**2)에 대한 설명으로 옳지 않은 것은? 27
#
# 1. 총제곱의 합 중 설명된 제곱의 합의 비율을 뜻한다.
# 2. 종속변수에 미치는 영향이 적은 독립변수가 추가된다면 결정계수는 변하지 않는다.
# 3. R**2의 값이 클수록 회귀선으로 실제 관찰치를 예측하는 데 정확성이 높아진다.
# 4. 독립변수와 종속변수 간의 표본상관계수 r의 제곱값과 같다.
#
# 답 2
#
# 다음 시계열 분석의 기초가 되는 개념인 정상성(stationarity)의 특징에 관한 설명이다.
# 설명이 옳지 않은 것은? # 28
#
# 1. 평균이 일정하다. 즉 모든 시점에 대한 일정한 평균을 가진다.
# 2. 시계열 분석에서 비정상 시계열 자료는 시계열 분석을 할수 없다.
# 3. 분산도 시점에 의존하지 않는다.
# 4. 공분산은 단지 시차에만 의존하고 실제 어느 시점 t,s에는 의존하지 않는다.
#
# 답 2
#
# 시계열에 관한 설명 중 틀린 것은? # 29
#
# 1. 대부분의 시게열은 비정상 자료이다. 그러므로 비정상 자료를 정상성 조건에 만족시켜 정상시계열
# 로 만든 후 시계열 분석을 한다.
# 2. 시계열이 정상 시계열인지 비정산 시계열인지 판단하기 위해 폭발적인 추세를 보이거나 시간에 따
# 라 분산이 변화하는지 관찰해야한다.
# 3. 비정상 시계열은 정상 시계열로 변경하고자 때 변환과 차분의 방법을 사용한다.
# 4. 일반적으로 평균이 일정하지 않은 비정상 시계열은 변환을 통해, 분산이 일정하지 않은 비정상 시
# 계열은 차분을 통해 정상 시계열로 바꾼다.
#
# 답 4
#
# 아래의 전차도를 보고 회귀분석의 가정 중 어떤 가정이 위배되었다고 판단할 수 있는가? # 30
#
# 1. 비상관성
# 2. 등분산성
# 3. 선형성
# 4. 독립성
#
# 답 2
