# 다음 headsize 데이터는 25개 가구에서 첫 번째와 두 번째 성인 아들의 머리길이(head)와 머리 폭
# (breadth)을 보여준다. 이에 대한 설명 중 가장 부적절한 것은? # 31
#
# 1. 주성분분석의 결과를 보여준다.
# 2. 첫 두 개의 주성분으로 전체 데이터 분산의 91%를 설명할 수 있다.
# 3. 두 번째 주성분은 네 개의 원변수와 양의 상관관계를 가진다.
# 4. 네 개의 주성분을 사용하면 전체 데이터 분산을 모두 설명할 수 있다.
#
# 답 3
#
# 데이터마이닝의 활용 예가 아닌 것은 어느 것인가? # 32
#
# 1. 병원에서 환자 데이터를 이용해 해당 환자에게 발생 가능성이 높은 병을 예측한다.
# 2. 웹사이트에 접속한 고객 정보를 활용해 고객에게 맞는 상품과 서비스를 추천한다.
# 3. 대용량 데이터를 통해 선거의 후보자 인지율 확인을 위한 전화조사에 활용할 대상 리스트를 만들어
# 낸다.
# 4.은행에서 대출 심사를 할때, 고객 데이터를 활용해 고객의 우량/불량을 예측한다.
#
# 답 3
#
# 데이터마이닝 모델링 방법 중 분류(classification) 방법으로 활용되지 않는 R 패키지는 무엇인가? # 33
#
# 1. rpart
# 2. kmeans
# 3. party
# 4. marginTree
#
# 답 2
#
# 모형의 성능을 평가할 때 사용되는 방법론 중 사후확률과 각 분류기준값에 의해 오분류 행렬을 만든
# 다음, 민감도(sensitivity)와 특이도(specigicity)를 산출하여 도표에 도식화하여 평가하는 방식은 무엇
# 인가? # 34
#
# 1. ROC(receive operating characteristics)
# 2. 이익도표(Lift)
# 3. AUROC
# 4. 예측률(Prediction rate)
#
# 답 1
#
# K-means 군집분석과 계층적 군집분석의 차이를 잘못 설명한 것은? # 35
#
# 1. K-means 군집분석은 게층적 군집분석과는 달리 한 개체가 처음 속한 군집에서 다른 군집으로 이동
# 해 재배치 될 수 있다.
# 2. K-means 군집분석은 초기값에 대한 의존이 커서 초기값을 어떻게 하느냐에 따라 군집이 달라질 수
# 있다.
# 3. K-means 군집분석은 동일한 거래계산법을 적용하면 몇 번을 시행해도 동일한 결과가 나온다.
# 4. 계층적 군집분석은 동일한 거리계산법을 적용하면 몇 번을 시행해도 동일한 결과가 나온다.
#
# 답 3
#
# 데이터를 이용해 분석한 결과 "샌드위치를 사는 고객의 30%가 탄산수를 함께 산다"와 같은 결과를 얻
# 기 위해 실행되는 데이터마이닝 분석 방법론은 무엇인가? # 36
#
# 1. 군집분석(clustering)
# 2. 분류분석(classification analysis)
# 3. 장바구니분석(market basket analysis)
# 4. 순차분석(sequence analysis)
#
# 답 3
#
# 다음 중 이상값 검색을 활용한 응용시스템으로 가장 적절한 것은? # 37
#
# 1. 장바구니분석 시스템
# 2. 부정사용방지 시스템
# 3. 데이터 마트
# 4. 교차판매 시스템
#
# 답 2
#
# 아래는 스위스의 47개 프랑스어 사용지역의 출산율(Fertility)과 관련된 변수들을 사용하여 얻은 결과
# 이다. 회귀모형에 관한 다음 설명 중 가장 부적절한 것은? # 38
#
# 1. 유의수준 0.05하에서 위의 회귀모형은 유의적으로 출산율을 설명한다.
# 2. 위의 설명변수들은 출산율 변동의 원인임을 보여준다.
# 3. 위의 회귀모형은 출산율 변동의 70.67%를 설명한다.
# 4. 수정결정계수는 0.671이다.
#
# 답 2
#
# 아래 데이터 셋 A, B간의 유사성을 유클리드 거리로 계산하면? # 39
#
# 구분	A	B
# 키	180	175
# 몸무게	65	70
#
# 1. 0
# 2. √5
# 3. √25
# 4. √50
#
# 답 4
#
# 분류문제를 예측하기 위한 모형을 개발하여 테스트 데이터를 통해 그 결과를 분석하고자 한다. 아래
# 표를 활용하여 민감도를 구하려고 할 때 민감도를 산출하는 방식은 어떤 것인가? # 40
#
# 아래
# 		|질병		여부
# 		|양성	|	음성
# 테스트	|양성	TP(True Positive)	FP(False Positive)
# 테스트	|음성	FN(False Negative)	TN(True Negative)
#
# 1. TP(TP+FN)
# 2. FN/(TP+FN)
# 3. FP/(FP+TN)
# 4. TN/(FP+TN)
#
# 답 1
#
#
