# 개인의 사생활 침해를 방지하고 통계 응답자의 비밀사항은 보호하면서 통계자료의 유용성을 최대한
# 확보 할 수 있는 데이터변환 방법은 무엇인가? # 1
#
# 답 마스킹(masking)
#
# 아래의 (ㄱ)에 적절한 데이터베이스 용어는? # 2
#
# 아래
# 데이터(ㄱ)이란 데이터베이스 내의 데이터에 대한 정확성 일관성, 유효성, 신뢰성을 보장하기 위해 데
# 이터 변경 혹은 수정 시 여러 가지 제한을 두어 데이터의 정확성을 보증하는 것을 말한다.
#
# 답 무결성(integrity)
#
# 데이터 분석 기획을 위해서 데이터 분석 수준진단이 필요하다. 분석 준비도와 분석 성숙도를 통해 데
# 이터 분석 수준을 진단하게 되는데, 분석준비도 6개의 영역 중 2가지를 적으시오 # 3
#
# 답 분석업무, 분석 인력/조직, 분석 기법, 분석 데이터, 분석 문화, 분석 인프라
#
# 아래 (ㄱ),(ㄴ),(ㄷ) 안에 들어갈 용어를 순서대로 기입하시오. # 4
#
# 아래
# 비즈니스 모델 캔버스는 9가지 블록을 단순화하여(ㄱ),(ㄴ), 고객단위로 문제를 발굴하고 이를 관리 하
# 는 규제와 감사, (ㄷ)영역으로 나눠 분석 기회를 도출한다.
#
# 답 ㄱ:업무, ㄴ:제품, ㄷ:지원 인프라
#
# 이것은 데이터 안의 두 변수 간의 관계를 알아보기 위해 사용하는 값이다. 두 변수간의 공분산으로 음
# 과 양의 관계를 파악할 수 있으나 관계 정도를 확인하기는 힘들다. 그래서 각 변수의 표준편차를 곱
# 하여 공분산을 나누어 -1에서 1사이 값으로 표준화하여 두 변수 간의 관계 정도를 확인 할 수 있도록
# 수치화 한 이것을 확용한다. 이것은 무엇인가? # 5
#
# 답 상관계수(correlation)
#
# 아래 R코드의 출력 결과는? # 6
#
# 아래
# > f <- function)x,a) return((x-a)^2)
# > f(1:2,3)
#
# 답 41
#
# 우리는 모집단을 조사하기 위해 추출한 모집단의 일부 원소를 이용한다. 통계자료의 획득 방법 중 모
# 집단을 조사하기 위해 추출한 집단을 무엇이라 하는가? # 7
#
# 답 샘플(sample)
#
# 다음 중 아래 거래 전표에서 연관 규칙 "C->A"의 신뢰도를 구하시오. # 8
#
# 물품		거래건수
# {A}		100
# {C}		50
# {A,C}		200
# {B,C}		250
# {B,D}		200
# {A,B,D}		200
# {A,B,C,D}		100
#
# 답 50%
# 
# 동시에 구매될 가능성이 큰 상품군을 찾아내는 연관성 측정에 시간이라는 개념을 포함시켜 순차적인
# 구매 가능성이 큰 상품군을 찾아내는 데이터 마이닝 기법은? # 9
#
# 답 순차 분석(Sequence Analysis)
#
# 주성분분석을 통해 얻은 R프로그램의 결과가 아래와 같이 나왔다. 3개의 변수를 활용할 경우 전체 데
# 이터의 몇 %를 설명할 수 있는지 쓰시오.(소수점 셋째 자리에서 반올림하여 표기하시오) # 10
#
# > summary (princomp ( g, cor=TRUE) )
# Timprtance of components :
#
#
# 			Comp.1		Comp.2		Comp.3		Comp.4		Com.5		Com.6
# standard deviation		1.4836004	1.2189318	0.9559265	0.8630097	0.7066937	0.39364935
# Proprotion of Variance	0.3668747	0.2476324	0.1522993	0.1241310	0.0832360	0.02582664
# Cumulative Proprotion	0.3668747	0.6145071	0.7668064	0.8909374	0.9741734	1.00000000
#
# 답 76.68%