# 다음 중 빅데이터가 만드렁 내는 변화와 가장 거리가 먼 것은? # 1
#
# 1. 가치가 있을 것이라고 에상되는 특정한 정보만 모아서 처리하는 것이 아니라 가능한 한 많은 데이터
# 를 모으고 그 데이터를 다양한 방식으로 조합해 숨은 정보를 찾아내는 방식이 중요해진다.
# 2. 데이터의 규모가 증가함에 따라 사소한 몇 개의 오류 데이터는 분석결과에 영향은 미치지 않기 때문
# 에 데이터세트에 포함하여 분석해도 상관없는 경우가 많아진다.
# 3. 데이터의 양이 증가하고 유형이 복잡해짐에 따라 수많은 데이터 중에서 분석에 필요한 데이터를 선
# 정하기 위해 정교한 표본조사 기법의 중요성이 대두되고 있다.
# 4. 인과관계의 규명 없이 상관관계 분석 결과만으로도 인사이트를 얻고 이를 바탕으로 수익을 창출할
# 수 있는 기회가 점차 늘어나고 있다.
#
# 답 3
#
# 다음 중 빅데이터 현상이 출현하게 된 배경과 가장 거리가 먼 것은? # 2
#
# 1. 의료정보 등 공공데이터의 개방 가속화
# 2. M2M, Iot와 같은 통신 기술의 발전
# 3. 하둡 등 분산처리 기술의 발전
# 4. 트위처, 페이스북 등 SNS의 급격한 확산
#
# 답 1
#
# 다음 중 데이터베이스 설계 절차가 적절하게 배치된 것은? # 3
#
# 1. 요구사항 분석 -> 개념적 설계 -> 논리적 설계 -> 물리적 설계
# 2. 요구사항 분석 -> 객체적 설계 -> 논리적 설계 -> 물리적 설계
# 3. 요구사항 분석 -> 물리적 설계 -> 개념적 설계 -> 논리적 설계
# 4. 요구사항 분석 -> 개념적 설계 -> 객체적 설계 -> 논리적 설계
#
# 답 1
#
# 다음 중 "커피를 구매하는 사람이 탄산음료를 더 많이 구입하는가?"에 대한 문제를 해결한 빅데이터 분
# 석 기법은 무엇인가? # 4
#
# 1. 유전 알고리즘
# 2. 연관 규칙 학습
# 3. 회귀 분석
# 4. 감성 분석
#
# 답 2
#
# 다음 중 감성분석에 대한 설명으로 부적절한 것은? # 5
#
# 1. 사용자간의 사회적 관계를 알아내고자 할 때 이용됨
# 2. 고객의 주관적 평가를 측정하고자 할 때 수행됨
# 3. 특정 주제에 대해 사용자의 긍정 부정 의견을 분석
# 4. 주로 문장이나 단어가 분석 대상이 됨
#
# 답 1
#
# 기업 내부 데이터베이스를 기반으로 다양한 정보시스템이 구축·활용되고 있다. 고객 관련 데이터베이스
# 를 분석하여 고객 개개인에게 적합한 차별적 제품 및 서비스를 제공함으로써 고객과의 관계를 지속적
# 으로 강화해 나가기 위해 구축하는 정보시스템은 다음 중 무엇인가? # 6
#
# 1. CRM시스템
# 2. SCM시스템
# 3. ERP시스템
# 4. KMS시스템
#
# 답 1
#
# 다음 중 개인정보 비식별화 기법을 설명한 것으로 부적절한 것은? # 7
#
# 1. 가명처리 - 개인 식별이 가능한 데이터에 대하여 직접적으로 식별 할 수 없는 다른 값으로 대체
# 2. 범주화 - 단일 식별 정보를 해당 그룹의 대표 값으로 변화
# 3. 데이터마스킹 - 개인 정보 식별이 가능한 특정 데이터 값 삭제 처리
# 4. 총계처리 - 개별 데이터 값을 총합 또는 평균값으로 대체하는 것
#
# 답 3
#
# 다음 중 데이터의 유형이 다른 하나는? # 8
#
# 1. 개인 페이스북에 올린 어느 회사 제품에 대한 사용 후기글
# 2. 어느 기계에서 작동하는 동안 발생한 소음을 데시벨 단위로 기록한 센서 데이터
# 3. 어느 포털 사이트에서 하루 동안 언급된 모든 검색어
# 4. 콜센터에 접수된 어느 고객의 제품 불만사항을 녹음한 음성파일
#
# 답 2
#
# 다음 중 CRISP-DM 방법론의 모델링 단계에서 수행하는 태스크가 아닌 것은? # 9
#
# 1. 모델 테스트 계획 설계
# 2. 모델링 기법 선택
# 3. 모델 평가
# 4. 모델 적용성 평가
#
# 답 4
#
# 다음 중 분석 프로젝트 관리에 대한 설명으로 가장 부적절한 것은? # 10
#
# 1. 분석 프로젝트 관리는 KSA ISO 21500:2013을 가이드로 활용할 수 있다.
# 2. 데이터 분석 모델의 품질을 평가하기 위해서 SPICE를 활용할 수 있다.
# 3. 분석 프로젝트의 일정계획 수립 시 데이터 수집에 대한 철저한 통제와 관리가 필요하다.
# 4. 분석 프로젝트의 최종 산출물이 보고서 또는 시스템인지에 따라 프로젝트 관리에 차이가 있다.
#
# 답 3
#
