# 분석과제의 특징 중 Accuracy와 Precision에 대한 설명으로 가장 부적절한 것은? # 11
#
# 1. 분석의 활용적인 측면에서는 Accuracy가 중요하며 안정성 측면에서는 Precision이 중요
# 2. Accuracy는 모델과 실제 값과의 차이를 평가하는 정확도를 의미
# 3. Precision은 모델을 지속적으로 반복했을 때의 편차의 수준으로써, 일관적으로 동일한 결과를 제시
# 한다는 의미
# 4. Accuracy와 Precision은 Trade-Off관계가 없음
#
# 답 4
#
# 기업에서 기존에 수행했던 데이터 분석 또는 BI(Business Intelligence)와 비교하여, 빅데이터 분석에 대
# 한 키워드를 가장 적절하게 표현한 것은? # 12
#
# 1. Clean Data, Statistical Analysis, Forecast, Predict
# 2. Optimize, Predict, Forecast, Statistical Analysis
# 3. Alerts, Predict, Optimize, Ad hoc Report
# 4. Information, Ad hoc Report, Alerts, Clean Data
#
# 답 4
#
# 분석의 대상 및 방식에 따라서 분석의 주제는 크게 4가지 유형으로 나뉜다. 이 중 분석 대상은 명확 하
# 지만 분석 방식이 명확하지 않은 경우 수행하는 주제 유형으로 가장 적절한 것은? # 13
#
# 1. Optimization 유형
# 2. Discovery 유형
# 3. Insight 유형
# 4. Solution 유형
#
# 답 4
#
# 빅데이터의 특징을 고려한 분석 ROI 요소와 분석우선순위 평가기준에 대한 설명으로 가장 부적절한 것
# 은? # 14
#
# 1. 분석과제의 우선순위 평가에서 시급성은 전략적 중요도,데이터 수집비용 등을 평가하고 난이도는
# 분석 수준과 복잡도가 평가요소이다.
# 2. 분석 난이도는 분석 준비도와 성숙도 진단 결과에 따라 해당 기업의 분석 수준을 파악하고 이를 바
# 탕으로 결정된다.
# 3. 시급성이 높고 난이도가 높은 분석과제는 경영진 또는 실무 담당자의 의사결정에 따라 적용 우선순
# 위를 조정할 수 있다.
# 4. 시급성이 높고 난이도가 낮은 분석과제는 우선순위가 높다.
#
# 답 1
#
# 다음 중 CRISP-DM 분석 방법론에서 업무 이해(Business Understanding)에 해당하는 것은? # 15
#
# 1. 초기 데이터 수집 - 데이터 기술 분석 - 데이터 탐색 - 데이터 품질 확인
# 2. 업무 목적 파악 - 상황 파악 - 데이터 마이닝 목표 설정 - 프로젝트 계획 수립
# 3. 모델링 기법 선택 - 모델 테스트 계획 설계 - 모델 작성 - 모델 평가
# 4. 분석 결과 평가 - 모델링 과정 평가 - 모델 적용성 평가
#
# 답 2
#
# 데이터 분석을 위한 조직 구조 중 아래에 해당하는 것은? # 16
#
# 아래
# ▶전사 분석업무를 별도의 분석 전담 조직에서 담당
# ▶전략적 중요도에 따라 분석조직이 우선 순위를 정해서 진행 가능
# ▶현업 업무부서의 분석업무와 이중화/이원화 가능성 높음
#
# 1. 분산구조
# 2. 기능구조
# 3. 집중구조
# 4. 복합구조
#
# 답 3
#
# 다음 중 연속형 확률 변수의 분포 중 정규분포로부터 유도되었으며, 정규 분포의 평균을 측정할 때 주
# 로 사용되는 분포로 두 집단의 평균 차이 검증 등에 활용되는 분포는? # 17
#
# 1. 균일분포(uniform distribution)
# 2. 지수분포(exponential distribution)
# 3. t-분포(t-distribution)
# 4. F-분포(F-distribution)
#
# 답 3
#
# 이산형 확률 분포 중 하나로 개별 사건이 두 가지 경우만 존재하며, 각 사건이 성공할 확률이 일정하고
# 전·후 사건에 독립적인 특수한 상황의 확률 분포를 나타내는 것은? # 18
#
# 1. 포아송분포
# 2. 지수분포
# 3. 다항분포
# 4. 베르누이 확률분포
#
# 답 4
#
# 다음 중 확실하게 증명하고 싶은 가설, 뚜렷한 증거가 있어야 채택할 수 있는 가설(hypothesis)은? # 19
# 
# 1. 대립가설
# 2. 영가설
# 3. 귀무가설
# 4. 기각가설
#
# 답 1
#
# 다음 중 비모수 검정 방법 중 하나로 표본들이 서로 관련되어 있는 경우 짝지어진 두 개의 관찰치들의
# 크고 작음을 표시하여 그 개수를 가지고 두 분포의 차이가 있는지에 대한 가설을 검증하는 방법은?
# # 20
#
# 1. 런 검정(run test)
# 2. 만-위트니의 U검정
# 3. 부호 검정(sign test)
# 4. 스피어만 순위상관계수
#
# 답 3
#
