# 다음 중 소득 수준과 같이 정규 분포를 따르지 않고 오른쪽 꼬리가 긴(right-skewed)분포를 나타내는
# 자료의 평균과 중앙값의 관계로 옳은 것은 무엇인가? # 21
#
# 1. 자료의 크기(scale)에 따라 달라진다.
# 2. 평균이 중앙값보다 작은 경향을 보인다.
# 3. 평균과 중앙값이 일치하는 경향을 보인다.
# 4. 평균이 중앙값보다 큰 경향을 보인다.
#
# 답 4
#
# 다음 중 중앙 50%의 데이터들이 흩어진 정도를 의미하는 것은 무엇인가? # 22
#
# 1. 사분위범위(interquartile range)
# 2. 중앙값(median)
# 3. 표준편차(standard deviation)
# 4. 평균(mean)
#
# 답 1
#
# 다음 중 한 변수를 단조 증가 함수로 변환하여 다른 변수를 나타낼 수 있는 정도를 나타내며 두 변수의
# 선형 관계의 크기 뿐만 아니라 비선형적인 관계도 나타낼 수 있는 상관계수는 무엇인가? # 23
#
# 1. 코사인 유사도
# 2. 피어슨 상관계수
# 3. 스피어만 상관계수
# 4. 자카드 인덱스
#
# 답 3
# 다음 분류 분석 모형 중 훈련용 데이터 집합으로부터 미리 모형을 학습하는 것이 아니라 새로운 자료에
# 대한 예측 및 분류를 수행할 때 모형을 구성하는 lazy learning기법을 사용하는 것은 무엇인가? # 24
#
# 1. 유전자 알고리즘(genetic algorithm)
# 2. 최근접 이웃(nearest neighbor) 모형
# 3. 신경망(artificial neural network) 모형
# 4. 서포트 벡터 기계(support vector machine)
#
# 답 2
#
# 다음 중 아래 (ㄱ)에서 설명하는 활성함수로 가장 적절한 것은? # 25
#
# 1. 계산(step) 함수
# 2. tanh 함수
# 3. ReLU 함수
# 4. 시그모이드(sigmoid) 함수
#
# 답 4
#
# 앙상블(ensemble) 모형은 여러 모형의 결과를 결합함으로써 단일 모형으로 분석했을 때보다 신뢰성
# 높은 예측값을 얻을 수 있다. 다음 중 앙상블 모형의 특징으로 옳지 않은 것은? # 26
#
# 1. 이상값(outlier)에 대한 대응력이 높아진다.
# 2. 전체적인 예측값의 분산을 감소시켜 정확도를 높일 수 있다.
# 3. 모형의 투명성이 떨어져 원인 분석에는 적합하지 않다.
# 4. 각 모형의 상호 연관성이 높을수록 정확도가 향상된다.
#
# 답 4
#
# 다음 중 의사결정나무를 앙상블(ensemble)하는 방법 중 전체 변수 집합에서 부분 변수 집합을 선택하
# 여 각각의 데이터 집합에 대해 모형을 생성한 후 결합하는 방식은? # 27
#
# 1. 부스팅(boosting)
# 2. 배깅(bagging)
# 3. 랜덤포레스트(random forest)
# 4. 붓스트랩(bootstrap)
#
# 답 3
#
# 다음 중 아래에서 설명하는 문제를 나타내는 용어로 적절한 것은? # 28
#
# 아래
# 분류 모형을 구성하는 경우 예측 실패의 비용이 큰 분류 분석의 대상에 대한 관측치가 현저히 부족하여
# 모형이 제대로 학습되지 않는 문제가 발생된다.
#
# 1. 과대적합 문제(overfitting problem)
# 2. 과소적합 문제(underfitting problem)
# 3. 범주 불균형 문제(case imbalance problem)
# 4. 정보과부하 문제(information overload problem)
#
# 답 3
#
# 분류 모형의 평가 기준 중 정확도(precision)와 재현율(recall)은 한 지표의 값이 높아지면 다른 지표의
# 값이 낮아질 가능성이 높다. 이러한 효과를 보정하여 하나의 지표를 나타낸 F(B)지표에서 B=2일 경우
# 다음 설명 중 옳은 것은? # 29
#
# 1. 정확도(precision)에 2배만큼의 가중치를 부여하여 조화 평균한다.
# 2. 정확도(precision)와 재현율(recall)을 조화 평균한 뒤 0.5배한다.
# 3. 정확도(precision)와 재현율(recall)을 조화 평균한 뒤 2배한다.
# 4. 재현율(recall)에 2배만큼의 가중치를 부여하여 조화 평균한다.
#
# 답 4
#
# 다음 중 인공 신경망 모형에서 역전파를 진행함에 따라 각 노드를 연결하는 가중치의 절대값이 커져
# 조정이 더 이상 이루어지지 않아 과소적합(underfitting)이 발생되는 문제는? # 30
#
# 1. 비선형 문제
# 2. 전역최적화 문제
# 3. 포화 문제
# 4. 수용 영역 국소화 문제
#
# 답 3
#
