# 모델링은 현실세계에 대해서 표현하는 것으로 이해할 수 있다. 다음 중 모델링의 특징으로 가장
# 부적절한 것은?
#
# 1. 현실세계를 일정한 형식에 맞추어 표현하는 추상화의 의미를 가질 수 있음
# 2. 시스템 구현만을 위해 진행하는 사전단계의 작업으로서 데이터베이스 구축을 위한 사전작업의
# 의미가 있음
# 3. 복잡한 현실을 제한된 언어나 표기법을 통해 이해하기 쉽게 하는 단순화의 의미를 가지고 있음
# 4. 애매모호함을 배제하고 누구나 이해가 가능하도록 정확하게 현상을 기술하는 정확화의 의미를 가짐
#
# 답 2
#
#
# 다음 설명 중 데이터 모델링이 필요한 주요 이유로 가장 부적절한 것은?
#
# 1. 업무정보를 구성하는 기초가  되는 정보들에 대해 일정한 표기법에 의해 표현한다.
# 2. 분석된 모델을 가지고 데이터 베이스를 생성하여 개발 및 데이터관리에 사용하기 위한 것이다.
# 3. 데이터베이스를 구축하기 위한 용도를 위해 데이터모델링을 수행하고 업무에 대한 설명은
# 별도의 표기법을 이용한다.
# 4. 데이터모델링 자체로서 업무의 흐름을 설명하고 분석하는 부분에 의미를 가지고 있다.
#
# 답 3
#
# 다음 중 데이터모델링을 할 때 유의해야 할 사항으로 가장 부적절한 것은?
#
# 1. 여러 장소의 데이터베이스에 같은 정보를 저장하지 않도록 하여 중복성을 초소화 한다.
# 2. 데이터의 정의를 데이터의 사용 프로세스와 분리하여 유연성을 높인다.
# 3. 사용자가 처리하는 프로세스나 장표 등에 따라 매핑이 될 수 있도록 프로그램과 테이블간의
# 연계성을 높인다
# 4. 데이터간의 상호 연관관계를 명확하게 정의하여 일관성 있게 데이터가 유지되도록 한다.
#
# 답 3
#
# 다음 중 아래 설명이 의미하는 데이터모델링의 유의점에 해당하는 특성은 무엇인가?
#
# 아래 : 데이터 모델을 어떻게 설계했느냐에 따라 사소한 업무변화에도 데이터모델이 수시로 변경됨
# 으로써 유지보수의 어려움응ㄹ 가중시킬 수 있다. 데이터의 정의를 데이터의 사용 프로세스와 분리
# 함으로써 데이터모델링은 데이터 혹은 프로세스의 작은 변화가 애플리케이션과 데이터베이스에 중대한
# 변화를 일으킬 수 있는 가능성을 줄인다.
#
# 1. 중복
# 2. 비유연성
# 3. 비일관성
# 4. 일관성
#
# 답 2
#
# 다음 중 아래 데이터모델링 개념에 대한 설명에서 ㄱ, ㄴ 에 들어갈 단어로 가장 적절한 것은?
#
# 아래 : 전사적 데이터 모델링을 수행할 때 많이 하며, 추상화 수준이 높고 업무 중심적이고 포괄적인
# 수준의 모델링을 진행하는 것을 ㄱ데이터 모델링이라고 한다. 이와 달리 실제로 데이터베이스에 이식
# 할 수 있도록 성능, 저장 등의 물리적인 성격을 고려한 데이터 모델링은 ㄴ데이터모델링 이라고 한다.
#
# 1. ㄱ-개념적, ㄴ-물리적
# 2. ㄱ-논리적, ㄴ-개념적
# 3. ㄱ-논리적, ㄴ-물리적
# 4. ㄱ-개념적, ㄴ-논리적
#
# 답 1
#
#
# 다음 중 ANSI-SPARC에서 정의한 3단게구조(three-level architecture)에서 아래 내용이 설명하는
# 스키마 구조로 적절한 것은?
#
# 아래
# - 모든 사용자 관점을 통합한 조직 전체 관점의 통합적 표현
# - 모든 응용시스템들이나 사용자들이 필요로 하는 데이터를 통합한 조직 전체의 DB를 기술한 것으로
# DB에 저장되는 데이터와 그들간의 관계를 표현하는 스키마
#
# 1. 외부스키마(External Schema)
# 2. 개념스키마(Conceptual Schema)
# 3. 내부스키마(Internal Schema)
# 4. 논리스키마(Logical Schema)
#
# 답 2
#
# 다음 중 고객과 주문의 ERD에 대한 설명으로 가장 부적절한 것은?
#
# 1. 한 명의 고객은 여러 개의 제품을 주문 할 수 있다. 주문은 할 수도 있고 안 할 수도 있다.
# 2. 하나의 주문은 반드신 한명의 고객에 의해 주문된다.
# 3. 주문에 데이터를 입력할 때는 반드시 고객데이터가 존재해야 한다.
# 4. 고객에 데이터를 입력할 때는 주문데이터가 존재하는 고객만을 입력할 수 있다.
#
# 답 4
#
# 다음 중 ERD에 대한 설명으로 가장 부적절한 것은?
#
# 1. 1976년 피터첸(Peter Chen)에 의해 Entity-Realtionship Model(E-R Model)이라는 표기법이
# 만들어 졌다.
# 2. 일반적으로 ERD를 작성하는 방법은 엔터티 도출 -> 엔터티 배치 -> 관계 설정 -> 관계명 기술의
# 흐름으로 작업을 해당한다.
# 3. 관계의 명칭은 관계 표현에 있어서 매우 중요한 부분에 해당한다.
# 4. 가장 중요한 엔터티를 오른쪽상단에 배치하고 추가 발생하는 엔터티들을 왼쪽 편과 하단에 배치하는
# 것이 원칙이다.
#
# 답 4
#
# 다음 중 아래 시나리오에서 엔터티로 가장 적절한 것은?
#
# 아래 : S병원은 여러 명의 환자가 존재하고 각 환자에 대한 이름, 주소 등을 관리해야 한다.
# (단, 업무범위와 데이터의 특성은 상기 시나리오에 기술되어 있는 사항만을 근거하여 판단해야함)
#
# 1. 병원
# 2. 환자
# 3. 이름
# 4. 주소
#
# 답 2
#
# 다음 중 엔터티의 특징으로 가장 부적절한 것은?
#
# 1. 속성이 없는 엔터티는 있을 수 없다. 엔터티는 반드시 속성을 가져야 한다.
# 2. 엔터티는 다른 엔터티와 관계가 있을 수 밖에 없다. 단, 통계성 엔터티나, 코드성 엔터티의 경우
# 관계를 생략할 수 있다.
# 3. 객체지향의 디자인패턴에는 싱글턴패턴이 있어 하나의 인스터스를 가지는 클래스가 존재한다.
# 이와 유사하게 엔터티는 한 개의 인스턴스를 가지는 것만으로도 충분한 의미를 부여할 수 있다.
# 4. 데이터로서 존재하지만 업무에서 필요로 하지 않으면 해당 업무의 엔터티로 성립될 수 없다.
#
# 답 3